"OK"="OK";
"CANCEL" = "Kumoa";
"Can't load bundle"="Bundlea ei voida ladata";
"Apple" = "Apple";
"Pictures" = "Kuvat";
"Other" = "Muu";
"CHOOSE" = "Valitse";
"DOT_MAC_AND_RSS" = "%@ ja RSS"; // %@ is (was) ".Mac" -- warning, this is used by QuartzComposerScreenSaver.
"VALIDATING_RSS" = "Tarkistetaan RSS:ää...";
"NO_FEED_FOUND" = "Syötettä ei löytynyt.";
"GETTING_ALBUMS" = "Haetaan albumeja…";
"SELECT_ALBUMS" = "Valitse näytettävät albumit:";
"INVALID_MEMBER_NAME" = "Virheellinen käyttäjätunnus.";
"NO_ALBUMS_FOR_USER" = "Tälle käyttäjälle ei löytynyt albumeja.";

/* strings for tool tips */
"minute" = "minuutti";
"minutes" = "minuuttia";
"hour" = "tunti";
"hours" = "tuntia";
"OPTIONS_BUTTON_TIP" = "Aseta valintoja tälle näytönsäästäjälle.";
"Never" = "Ei koskaan";
"Slideshow" = "Kuvaesitys";
"Collage" = "Kollaasi";
"Mosaic" = "Mosaiikki";

/* An alternate to "Display Style" for the segmented control label. */
"STYLE" = "Tyyli";

/* For contextual menu */
"DELETE" = "Poista";
"REVEAL_IN_FINDER" = "Näytä Finderissa";
"MOVE_TO_TRASH" = "Siirrä roskakoriin";

/* For add button */
"BROWSE_SCREEN_SAVERS" = "Selaa näytönsäästäjiä";
"ADD_MOBILE_ME_GALLERY" = "Lisää MobileMe-galleria…";
"ADD_PICTURES" = "Lisää kuvakansio…";
"ADD_RSS_FEED" = "Lisää RSS-syöte…";
"BROWSE_SCREEN_SAVERS_URL" = "http://www.apple.com/downloads/macosx/icons_screensavers/";
"ADD_SAVER_AX_VALUE" = "Lisää kuvia tai selaa näytönsäästäjiä";
"REMOVE_SAVER_AX_VALUE" = "Poista valittu näytönsäästäjä";

/* Alerts */
"INCOMPATIBLE_TITLE" = "Näytönsäästäjää %@ ei voida käyttää tällä tietokoneella.";
"INCOMPATIBLE_DESC" = "Ota yhteyttä näytönsäästäjän kehittäjään ja pyydä uudempi versio.";
"DELETE_WARNING_TITLE" = "Haluatko varmasti poistaa kohteen ”%@?”";
"DELETE_WARNING_DESC" = "Näytönsäästäjä siirretään roskakoriin. ";
